Repository: blinkdagger182/waktusolat
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ms

source: 5 minutes
ms: 5 minit

source: 10 mins
ms: 10 minit

source: 15 mins
ms: 15 minit

source: 27th Night of Ramadan
ms: Malam ke-27 Ramadan

source: 30 mins
ms: 30 minit

source: 45 mins
ms: 45 minit

source: A strong possibility for Laylatul Qadr — the Night of Decree when the Qur’an was sent down — though not confirmed.
ms: Satu kemungkinan besar berlakunya Lailatulqadar, malam turunnya al-Quran, walaupun tidak dipastikan secara khusus.

source: Afternoon
ms: Petang

source: ALERT NOTIFICATION SOUND
ms: BUNYI PEMBERITAHUAN AMARAN

source: ALL PRAYER NOTIFICATIONS
ms: SEMUA PEMBERITAHUAN SOLAT

source: APPEARANCE
ms: PENAMPILAN

source: Arabic Alphabet
ms: Abjad Arab

source: Arabic Font
ms: Fon Arab

source: Ashura marks the day Allah saved Musa (Moses) and the Israelites from Pharaoh; fasting expiates sins of the previous year.
ms: Asyura menandakan hari Allah menyelamatkan Musa dan Bani Israel daripada Firaun; puasa pada hari ini menjadi kaffarah dosa setahun yang lalu.

source: Asr
ms: Asar

source: Auto mode uses your current location to determine the prayer zone.
ms: Mod automatik menggunakan lokasi semasa anda untuk menentukan zon waktu solat.

source: Bahasa Melayu Translation
ms: Terjemahan Bahasa Melayu

source: Basic Font
ms: Fon Asas

source: Begin obligatory fast
ms: Mulakan puasa wajib

source: Beginning of Hajj
ms: Permulaan Haji

source: Buy Me a Coffee
ms: Belanja Saya Kopi

source: Calculation
ms: Pengiraan

source: Cancel
ms: Batal

source: Celebration marking the end of Ramadan; fasting is prohibited on this day; encouraged to fast 6 days in Shawwal.
ms: Sambutan yang menandakan berakhirnya Ramadan; berpuasa pada hari ini dilarang; digalakkan berpuasa 6 hari dalam Syawal.

source: Celebration of ending the fast
ms: Sambutan berakhirnya puasa

source: Celebration of sacrifice during Hajj
ms: Sambutan korban ketika haji

source: Centered
ms: Tengah

source: Choose how zikir text is aligned in the home and lock screen zikir widgets.
ms: Pilih cara teks zikir dijajarkan dalam widget zikir skrin utama dan skrin kunci.

source: Close
ms: Tutup

source: Color Theme
ms: Tema Warna

source: Combined Traveling Dhuhr and Asr
ms: Zuhur dan Asar Jamak Ketika Musafir

source: Combined Traveling Maghrib and Isha
ms: Maghrib dan Isyak Jamak Ketika Musafir

source: Compass may not be accurate on Apple Watch
ms: Kompas mungkin tidak tepat pada Apple Watch

source: Concise
ms: Ringkas

source: Confirm: Keep On
ms: Sahkan: Kekalkan Hidup

source: Confirm: Turn Off
ms: Sahkan: Matikan

source: Continue
ms: Teruskan

source: Copy Address
ms: Salin Alamat

source: Copy Arabic
ms: Salin Arab

source: Copy Event Description
ms: Salin Huraian Acara

source: Copy Event Name
ms: Salin Nama Acara

source: Copy Event Subtitle
ms: Salin Subtajuk Acara

source: Copy Gregorian Date
ms: Salin Tarikh Masihi

source: Copy Hijri Date
ms: Salin Tarikh Hijri

source: Copy Image
ms: Salin Imej

source: Copy Text
ms: Salin Teks

source: Copy Translation
ms: Salin Terjemahan

source: Copy Transliteration
ms: Salin Transliterasi

source: Copy Waktu Zone
ms: Salin Zon Waktu

source: Credits
ms: Penghargaan

source: CREDITS
ms: PENGHARGAAN

source: CURRENT PRAYER
ms: SOLAT SEMASA

source: Daily Quran
ms: Al-Quran Harian

source: DAILY QURAN
ms: AL-QURAN HARIAN

source: DAILY ZIKIR REMINDERS
ms: PERINGATAN ZIKIR HARIAN

source: Dark
ms: Gelap

source: Dawn
ms: Fajar

source: Day Before Ashura
ms: Hari Sebelum Asyura

source: Day of Arafah
ms: Hari Arafah

source: Day of Ashura
ms: Hari Asyura

source: DEBUG LIVE ACTIVITY
ms: NYAHPEPIJAT AKTIVITI LANGSUNG

source: Debug options
ms: Pilihan nyahpepijat

source: Debug Timing Mode
ms: Mod Masa Nyahpepijat

source: Debug: WIDGETS
ms: Nyahpepijat: WIDGET

source: Default List View
ms: Paparan Senarai Lalai

source: Dhuhr
ms: Zuhur

source: Dhuhr (Jumuah)
ms: Zuhur (Jumaat)

source: Dhul Hijjah
ms: Zulhijjah

source: Dhul Qi'dah
ms: Zulkaedah

source: Donation Successful
ms: Sumbangan Berjaya

source: Donation Toast (Eid Pool)
ms: Toast Sumbangan (Kumpulan Raya)

source: Donation Toast (Generic)
ms: Toast Sumbangan (Umum)

source: Donation Toast (Launch 5)
ms: Toast Sumbangan (Pelancaran 5)

source: Donation Toast (Launch 6)
ms: Toast Sumbangan (Pelancaran 6)

source: Donation Toast (Monthly Pool)
ms: Toast Sumbangan (Kumpulan Bulanan)

source: Donation Toast (Streak 7)
ms: Toast Sumbangan (Rentetan 7)

source: Done
ms: Selesai

source: Eid Al-Adha
ms: Aidiladha

source: Eid Al-Fitr
ms: Aidilfitri

source: Enable Reminders
ms: Aktifkan Peringatan

source: End of Eid Al-Adha
ms: Akhir Aidiladha

source: Ends at
ms: Tamat pada

source: English Translation
ms: Terjemahan Inggeris

source: Fajr
ms: Subuh

source: Fasting for non-pilgrims expiates sins of the past and coming year.
ms: Puasa bagi yang tidak mengerjakan haji menjadi kaffarah dosa tahun lalu dan tahun akan datang.

source: Final day of Eid Al-Adha; pilgrims and non-pilgrims return to daily life.
ms: Hari terakhir Aidiladha; jemaah haji dan yang lain kembali kepada rutin harian.

source: First 10 Days of Dhul-Hijjah
ms: 10 Hari Pertama Zulhijjah

source: First Day of Ramadan
ms: Hari Pertama Ramadan

source: Full Surah
ms: Surah Penuh

source: Gentle
ms: Lembut

source: Gregorian to Hijri
ms: Masihi ke Hijri

source: Guided
ms: Berpanduan

source: Hajj and Eid end
ms: Haji dan hari raya berakhir

source: Haptic Feedback
ms: Maklum Balas Haptik

source: Highlights the meaning first, followed by the Arabic phrase.
ms: Menonjolkan maksud terlebih dahulu, diikuti dengan lafaz Arab.

source: Hijri Calendar
ms: Kalendar Hijri

source: Hijri Calendar Converter
ms: Penukar Kalendar Hijri

source: Hijri Converter
ms: Penukar Hijri

source: Hijri to Gregorian
ms: Hijri ke Masihi

source: Home Screen Widgets
ms: Widget Skrin Utama

source: If an Alif Mad is followed by a letter with a shaddah, the elongation extends to 6 counts.
ms: Jika Alif Mad diikuti oleh huruf yang mempunyai syaddah, pemanjangan bunyi menjadi 6 harakat.

source: Ignore
ms: Abaikan

source: IMPORTANT ISLAMIC DATES
ms: TARIKH ISLAM PENTING

source: In
ms: Dalam

source: iOS Default
ms: Lalai iOS

source: Isha
ms: Isyak

source: Islamic New Year
ms: Awal Tahun Hijrah

source: ISLAMIC RESOURCES
ms: SUMBER ISLAM

source: Islamic Wallpapers
ms: Kertas Dinding Islamik

source: It's time for %@
ms: Kini masuk waktu %@

source: JazakAllah Khair. Your support keeps this app alive.
ms: JazakAllah Khair. Sokongan anda memastikan aplikasi ini terus hidup.

source: Jumada al-Thani
ms: Jamadilakhir

source: Jumada al-Ula
ms: Jamadilawal

source: Keeps the reminder short with just the essentials.
ms: Mengekalkan peringatan yang ringkas dengan maklumat penting sahaja.

source: Keeps the zikir notification minimal and glanceable.
ms: Mengekalkan pemberitahuan zikir yang minimum dan mudah dilihat sepintas lalu.

source: Language
ms: Bahasa

source: LANGUAGE
ms: BAHASA

source: Last 10 Nights of Ramadan
ms: 10 Malam Terakhir Ramadan

source: Last known location, %@
ms: Lokasi terakhir diketahui, %@

source: Left Aligned
ms: Jajar Kiri

source: Light
ms: Cerah

source: Likely Laylatul Qadr
ms: Berkemungkinan Lailatulqadar

source: Live Activity appears 5 minutes before prayer time.
ms: Aktiviti Langsung muncul 5 minit sebelum waktu solat.

source: Live Activity Options
ms: Pilihan Aktiviti Langsung

source: LIVE ACTIVITY PRAYERS
ms: SOLAT AKTIVITI LANGSUNG

source: LIVE ACTIVITY TIMING
ms: MASA AKTIVITI LANGSUNG

source: Live Next Prayer Activity
ms: Aktiviti Langsung Solat Seterusnya

source: Loading Waktu Zone list...
ms: Memuat senarai Zon Waktu...

source: Location
ms: Lokasi

source: Lock Screen Widgets
ms: Widget Skrin Kunci

source: Made by developers at Risk Creatives, powered by the Waktu Solat Project API.
ms: Dibangunkan oleh pembangun di Risk Creatives, dikuasakan oleh API Projek Waktu Solat.

source: Made by developers at Risk Creatives.
ms: Dibangunkan oleh pembangun di Risk Creatives.

source: Malaysian Prayer Times/ JAKIM
ms: Waktu Solat Malaysia / JAKIM

source: Manual mode lets you select a specific Waktu Zone.
ms: Mod manual membolehkan anda memilih Zon Waktu tertentu.

source: Midday
ms: Tengah hari

source: minute
ms: minit

source: minutes
ms: minit

source: Most beloved days
ms: Hari-hari yang paling dicintai

source: Muharram
ms: Muharam

source: MUIS (Singapore)
ms: MUIS (Singapura)

source: Nagging before Asr
ms: Peringatan berulang sebelum Asar

source: Nagging before Dhuhr
ms: Peringatan berulang sebelum Zuhur

source: Nagging before Fajr
ms: Peringatan berulang sebelum Subuh

source: Nagging before Isha
ms: Peringatan berulang sebelum Isyak

source: Nagging before Maghrib
ms: Peringatan berulang sebelum Maghrib

source: Nagging before Sunrise
ms: Peringatan berulang sebelum Syuruk

source: NAGGING MODE
ms: MOD PERINGATAN BERULANG

source: Nagging mode helps those who struggle to pray on time. Once enabled, you'll get a notification at the chosen start time before each prayer, then another every 15 minutes, plus final reminders at 10 and 5 minutes remaining.
ms: Mod peringatan berulang membantu mereka yang sukar solat tepat pada waktunya. Apabila dihidupkan, anda akan menerima pemberitahuan pada masa mula yang dipilih sebelum setiap solat, kemudian satu lagi setiap 15 minit, serta peringatan terakhir apabila berbaki 10 dan 5 minit.

source: NEW WIDGET AVAILABLE
ms: WIDGET BAHARU TERSEDIA

source: Next in
ms: Seterusnya dalam

source: Next Prayer
ms: Solat Seterusnya

source: Next:
ms: Seterusnya:

source: Night
ms: Malam

source: No location
ms: Tiada lokasi

source: No matches found
ms: Tiada padanan ditemui

source: No Notification
ms: Tiada Pemberitahuan

source: No Waktu Zones found.
ms: Tiada Zon Waktu ditemui.

source: Not now
ms: Bukan Sekarang

source: Notification
ms: Pemberitahuan

source: Notification Settings
ms: Tetapan Pemberitahuan

source: Notification Sound
ms: Bunyi Pemberitahuan

source: NOTIFICATION SOUND
ms: BUNYI PEMBERITAHUAN

source: Notifications
ms: Pemberitahuan

source: NOTIFICATIONS
ms: PEMBERITAHUAN

source: Open app to get prayer times
ms: Buka aplikasi untuk mendapatkan waktu solat

source: Open app to refresh prayer times
ms: Buka aplikasi untuk memuat semula waktu solat

source: Open Settings
ms: Buka Tetapan

source: Open the Daily Quran lock screen widget once to load today’s summary here.
ms: Buka widget skrin kunci Al-Quran Harian sekali untuk memuatkan ringkasan hari ini di sini.

source: Open the Daily Quran widget once to load today’s verse here.
ms: Buka widget Al-Quran Harian sekali untuk memuatkan ayat hari ini di sini.

source: Open the iPhone app
ms: Buka aplikasi iPhone

source: Outside Supported Region
ms: Di Luar Wilayah Disokong

source: Override: Keep On
ms: Ganti: Kekalkan Hidup

source: Override: Turn Off
ms: Ganti: Matikan

source: Pilgrimage begins
ms: Ibadah haji bermula

source: Pilgrims begin the rites of Hajj, heading to Mina to start the sacred journey.
ms: Jemaah haji memulakan manasik haji dengan menuju ke Mina untuk memulakan perjalanan suci.

source: Please enable location services to accurately determine prayer times.
ms: Sila aktifkan perkhidmatan lokasi untuk menentukan waktu solat dengan tepat.

source: Please go to Settings and enable location services to accurately determine prayer times.
ms: Sila pergi ke Tetapan dan aktifkan perkhidmatan lokasi untuk menentukan waktu solat dengan tepat.

source: Please go to Settings and enable notifications to be notified of prayer times.
ms: Sila pergi ke Tetapan dan aktifkan pemberitahuan untuk menerima notis waktu solat.

source: PRAYER
ms: SOLAT

source: PRAYER CALCULATION
ms: PENGIRAAN SOLAT

source: Prayer Label
ms: Label Solat

source: PRAYER MESSAGE STYLE
ms: GAYA PEMBERITAHUAN SOLAT

source: Prayer Notification Style
ms: Gaya Pemberitahuan Solat

source: Prayer Notifications
ms: Pemberitahuan Solat

source: Prayer Reminders
ms: Peringatan Solat

source: PRAYER REMINDERS
ms: PERINGATAN SOLAT

source: PRAYER TIMES
ms: WAKTU SOLAT

source: Prenotification
ms: Pra-pemberitahuan

source: Prenotification Time:
ms: Masa Pra-pemberitahuan:

source: Preview the compact lock screen styles for quick prayer and zikir information.
ms: Pratonton gaya padat skrin kunci untuk maklumat solat dan zikir secara ringkas.

source: Preview the larger widget styles for prayer times and daily zikir.
ms: Pratonton gaya widget yang lebih besar untuk waktu solat dan zikir harian.

source: Profile
ms: Profil

source: PROFILE
ms: PROFIL

source: Quranic Font
ms: Fon Al-Quran

source: Rabi al-Awwal
ms: Rabiulawal

source: Rabi al-Thani
ms: Rabiulakhir

source: Rajab
ms: Rejab

source: Read Full Surah
ms: Baca Surah Penuh

source: Recommended to fast
ms: Disunatkan berpuasa

source: Reflective
ms: Renungan

source: Refresh Location
ms: Muat Semula Lokasi

source: Refresh prayer times on iPhone first.
ms: Muat semula waktu solat pada iPhone terlebih dahulu.

source: Request a feature
ms: Minta ciri baharu

source: Reset
ms: Tetapkan Semula

source: Resolving Waktu Zone...
ms: Sedang menentukan Zon Waktu...

source: Resources
ms: Sumber

source: RevenueCatUI not installed.
ms: RevenueCatUI tidak dipasang.

source: Roadmap
ms: Peta Jalan

source: Save
ms: Simpan

source: Save to Photos
ms: Simpan ke Foto

source: Seek Laylatul Qadr
ms: Carilah Lailatulqadar

source: Select Location
ms: Pilih Lokasi

source: Send a short Arabic zikir throughout the day, timed around your prayer windows.
ms: Hantar zikir Arab yang ringkas sepanjang hari, mengikut sela waktu solat anda.

source: Send Daily Zikir Notifications
ms: Hantar Pemberitahuan Zikir Harian

source: Set Home City
ms: Tetapkan Bandar Asal

source: Settings
ms: Tetapan

source: Sha'ban
ms: Syaaban

source: Shawwal
ms: Syawal

source: Show Before Prayer
ms: Tunjuk Sebelum Solat

source: Show Daily Quran Intro
ms: Tunjuk Pengenalan Al-Quran Harian

source: Show Description
ms: Tunjuk Huraian

source: Show prayers for today
ms: Tunjukkan waktu solat hari ini

source: Showing prayers for
ms: Menunjukkan waktu solat untuk

source: Shows a live countdown to the next prayer on the Lock Screen when that prayer notification is enabled.
ms: Menunjukkan kira detik langsung ke solat seterusnya pada Skrin Kunci apabila pemberitahuan solat itu diaktifkan.

source: Shows a short helper line, the Arabic zikir, and its meaning.
ms: Memaparkan panduan ringkas, zikir Arab, dan maksudnya.

source: Shows the full prayer reminder with time and location.
ms: Memaparkan peringatan solat lengkap dengan waktu dan lokasi.

source: Shurooq
ms: Syuruk

source: Standard
ms: Biasa

source: Start Custom Debug Live Activity
ms: Mulakan Aktiviti Langsung Nyahpepijat Tersuai

source: Start of Hijri year
ms: Permulaan tahun Hijrah

source: Start Test Live Activity (2 min)
ms: Mulakan Aktiviti Langsung Ujian (2 min)

source: Started at %@
ms: Bermula pada %1$@

source: Starts at
ms: Seterusnya

source: Starts at %@
ms: Seterusnya %1$@

source: Stop Debug Live Activity
ms: Hentikan Aktiviti Langsung Nyahpepijat

source: Sunrise
ms: Matahari terbit

source: Support
ms: Sokongan

source: SUPPORT
ms: SOKONGAN

source: Support Toast
ms: Toast Sokongan

source: System
ms: Sistem

source: Tap to Dismiss
ms: Ketik untuk Tutup

source: Text edition: %@ • Audio edition: ar.alafasy
ms: Edisi teks: %1$@ • Edisi audio: ar.alafasy

source: Text edition: ms.basmeih • Audio edition: ar.alafasy
ms: Edisi teks: ms.basmeih • Edisi audio: ar.alafasy

source: The best days for righteous deeds; fasting and dhikr are highly encouraged.
ms: Hari-hari terbaik untuk beramal soleh; puasa dan zikir sangat digalakkan.

source: The day of sacrifice; fasting is not allowed and sacrifice of an animal is offered.
ms: Hari korban; berpuasa tidak dibenarkan dan ibadah korban dilaksanakan.

source: The default list view is the standard interface found in many of Apple's first party apps, including Notes. This setting applies everywhere in the app except here in Settings.
ms: Paparan senarai lalai ialah antara muka standard yang digunakan dalam banyak aplikasi Apple, termasuk Notes. Tetapan ini digunakan di seluruh aplikasi kecuali di halaman Tetapan.

source: The first day of the Islamic calendar; no special acts of worship or celebration are prescribed.
ms: Hari pertama dalam kalendar Islam; tiada ibadah atau sambutan khusus yang disyariatkan.

source: The month of fasting begins; all Muslims must fast from Fajr (dawn) to Maghrib (sunset).
ms: Bulan puasa bermula; semua Muslim wajib berpuasa dari Subuh hingga Maghrib.

source: The most virtuous nights of the year; increase worship as these nights are beloved to Allah and contain Laylatul Qadr.
ms: Malam-malam paling utama dalam setahun; perbanyakkan ibadah kerana malam-malam ini dicintai Allah dan mengandungi Lailatulqadar.

source: The Prophet ﷺ intended to fast the 9th to differ from the Jews, making it Sunnah to do so before Ashura.
ms: Nabi ﷺ berniat untuk berpuasa pada 9 Muharam bagi membezakan umat Islam daripada Yahudi, menjadikannya sunnah sebelum Asyura.

source: Time left:
ms: Baki waktu:

source: Time left: %@
ms: Baki waktu: %1$@

source: Time Left: %@
ms: Baki waktu: %1$@

source: Today
ms: Hari Ini

source: TRAVEL COMBINED PRAYERS
ms: SOLAT JAMAK KETIKA MUSAFIR

source: Traveling Mode
ms: Mod Musafir

source: TRAVELING MODE
ms: MOD MUSAFIR

source: Traveling Mode Turns on Automatically
ms: Mod Musafir Hidup Secara Automatik

source: Turn On All Prayer Notifications
ms: Hidupkan Semua Pemberitahuan Solat

source: Turn on Nagging Mode
ms: Hidupkan Mod Peringatan Berulang

source: Turn on notifications to get prayer reminders and live countdown support. Waktu Solat will only show Apple's system prompt after you tap the button below.
ms: Hidupkan pemberitahuan untuk menerima peringatan solat dan sokongan kira detik langsung. Waktu Solat hanya akan memaparkan prompt sistem Apple selepas anda menekan butang di bawah.

source: Unable to load verse details.
ms: Tidak dapat memuatkan butiran ayat.

source: UPCOMING PRAYER
ms: SOLAT SETERUSNYA

source: Update Now
ms: Kemas Kini Sekarang

source: Update your application to the latest version
ms: Kemas kini aplikasi anda ke versi terkini

source: Upload
ms: Muat Naik

source: Used when Traveling Mode combines prayers.
ms: Digunakan apabila Mod Musafir menggabungkan solat.

source: Uses softer wording while keeping the prayer time clear.
ms: Menggunakan gaya bahasa yang lebih lembut sambil mengekalkan kejelasan waktu solat.

source: Verse details and recitation are fetched live from AlQuran Cloud.
ms: Butiran ayat dan bacaan dimuatkan secara langsung daripada AlQuran Cloud.

source: Version
ms: Versi

source: Version:
ms: Versi:

source: View Credits
ms: Lihat Penghargaan

source: Waktu Solat currently only supports (storefrontRegionName). We detected your location outside the supported region.
ms: Waktu Solat kini hanya menyokong (storefrontRegionName). Kami mengesan lokasi anda berada di luar wilayah yang disokong.

source: Waktu Solat has automatically detected that you are no longer traveling, so your prayers will not be shortened.
ms: Waktu Solat mengesan anda tidak lagi bermusafir, jadi solat anda tidak akan dipendekkan.

source: Waktu Solat has automatically detected that you are traveling, so your prayers will be shortened.
ms: Waktu Solat mengesan anda sedang bermusafir, jadi solat anda akan dipendekkan.

source: Waktu Solat Settings
ms: Tetapan Waktu Solat

source: Waktu Solat Setup
ms: Persediaan Waktu Solat

source: Waktu Zone
ms: Zon Waktu

source: Wallpapers
ms: Kertas Dinding

source: Web view is only available on iOS.
ms: Paparan web hanya tersedia pada iOS.

source: What's new
ms: Apa yang Baharu

source: Widget Options
ms: Pilihan Widget

source: Widget Preview
ms: Pratonton Widget

source: Widget Previews
ms: Pratonton Widget

source: Zikir Notification Style
ms: Gaya Pemberitahuan Zikir

source: Zikir notifications rotate through morning, midday, evening, and night using the same prayer-aware timing as the zikir widget.
ms: Pemberitahuan zikir berputar mengikut pagi, tengah hari, petang, dan malam menggunakan masa peka-solat yang sama seperti widget zikir.

source: Zikir Text Alignment
ms: Jajaran Teks Zikir
